spec/dummy/app/controllers/demos_controller.rb

  def chat
    room = params[:room].presence || "lobby"
    render_component ChatRoomComponent.new(room:, messages: ChatMessage.for_room(room).last(50))
---
SELECT "chat_messages".* FROM "chat_messages" WHERE "chat_messages"."room" = ? ORDER BY "chat_messages"."created_at" DESC, "chat_messages"."id" DESC LIMIT ?  [["room", "lobby"], ["LIMIT", 50]]